---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextStyleUnderline
source: html/d0053e9e-5eb0-63ba-224e-16f49565edc1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextStyleUnderline Property

"Underline"

## Syntax (C#)
```csharp
public static ForgeTypeId TextStyleUnderline { get; }
```